petersho/Arduino_qemu/hardware/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

######################################################
#ARM926EJS Qemu (WITHOUT) BOOTLOADER
qemu_arm926ejs.name=QEMU ARM926EJS
qemu_arm926ejs.vid.0=0x0C45
qemu_arm926ejs.pid.0=0x7600
qemu_arm926ejs.vid.1=0x0C45
qemu_arm926ejs.pid.1=0x5700
qemu_arm926ejs.vid.2=0x0C45
qemu_arm926ejs.pid.2=0x5701
qemu_arm926ejs.upload.tool=openocd
qemu_arm926ejs.upload.protocol=stk500v2
qemu_arm926ejs.upload.maximum_size=262144
qemu_arm926ejs.upload.use_1200bps_touch=true
qemu_arm926ejs.upload.wait_for_upload_port=true
qemu_arm926ejs.upload.native_usb=true
qemu_arm926ejs.upload.speed=57600
qemu_arm926ejs.build.mcu=arm926ej-s
qemu_arm926ejs.build.f_cpu=96000000L
qemu_arm926ejs.build.usb_product=
qemu_arm926ejs.build.board=SAMD_SONIX_MZERO_BL
qemu_arm926ejs.build.core=arduino
qemu_arm926ejs.build.extra_flags=-mthumb {build.usb_flags}
qemu_arm926ejs.build.ldscript=linker_scripts/gcc/qemu.ld
qemu_arm926ejs.build.openocdscript=openocd_scripts/arduino_zero.cfg
qemu_arm926ejs.build.variant=qemu_arm926
qemu_arm926ejs.build.variant_system_lib=Lib/*.lib
qemu_arm926ejs.build.vid=0x0C45
qemu_arm926ejs.build.pid=0x5701
qemu_arm926ejs.build.preferred_out_format=hex
qemu_arm926ejs.bootloader.size=0x4000
qemu_arm926ejs.build.emu.mcu=


qemu_arm926ejs.menu.upload_method.jLinkMethod=JLink
qemu_arm926ejs.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
qemu_arm926ejs.menu.upload_method.jLinkMethod.upload.protocol=jlink
qemu_arm926ejs.menu.upload_method.jLinkMethod.upload.device=SNC79122A1FG
